src/cf/src/InformationRegisters/ЗатраченноеВремяПоЗадачам/ЗатраченноеВремяПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗатраченноеВремяПоЗадачам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторФиксацииВремени</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтразитьРаботуПоЗадаче</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаПоЗадаче</name>
    <type>
      <types>DocumentRef.РаботыПоЗадаче</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРаботы</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ХронометражРабочегоВремениПользователей/ХронометражРабочегоВремениПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХронометражРабочегоВремениПользователей</name>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/CommonModules/УправлениеДоступомПереопределяемый/Module.bsl
//{{ *Олег Каратаев >>>>>>>>>>>>>>>>>>>>>>> ОПИСАНИЕ ИЗМЕНЕНИЙ >>>>>>>>>>>>>>>>>>>>>>>>>>>
// 
// ИЗМЕНЕННЫЕ СВОЙСТВА ОБЪЕКТА ОТСУТСТВУЮТ
// 
// НОВЫЕ/ИЗМЕНЕННЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//  * [Процедура]ПриЗаполненииПоставляемыхПрофилейГруппДоступа - добавлены профили
//  * [Процедура]ПриЗаполненииВидовДоступа - по рекомендации при переходе на версию 2.3.3 \1c\SSL\2_3_4_30\ExtFiles\Docs\UpdateSSL.htm
//  * [Процедура]ПриЗаполненииВидовОграниченийПравОбъектовМетаданных - рекомендация 3.0.2
//  * [Процедура]ПриЗаполненииСписковСОграничениемДоступа - рекомендация 3.0.2
// 
//}} *Олег Каратаев <<<<<<<<<<<<<<<<<<<<<<< ОПИСАНИЕ ИЗМЕНЕНИЙ <<<<<<<<<<<<<<<<<<<<<<<<<<<

// Разделитель описания изменений общего модуля >> *Олег Каратаев
Функция ИзмененияОбщегоМодуля()

	Возврат Неопределено;	

КонецФункции // Конец Разделитель описания изменений общего модуля


///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	// { *Олег Каратаев 
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление = НСтр("ru = 'Организации'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");	
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Проекты";
	ВидДоступа.Представление = НСтр("ru = 'Проекты'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Проекты");	
	// }		
	
КонецПроцедуры

// Позволяет указать объекты метаданных, для которых задана логика ограничения доступа к данным.
// В модулях менеджеров указанных списков размещается процедура обработчика, например:
//
//// Параметры:
////   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
////
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//  Ограничение.Текст =
//  "РазрешитьЧтениеИзменение
//  |ГДЕ
//  |	ЗначениеРазрешено(Организация)
//  |	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Логика ограничения доступа к данным также может быть переопределена в процедуре
// УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.
//
// Параметры:
//  Списки - Соответствие из КлючИЗначение - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера,
//                                   Ложь   - текст ограничения в этом переопределяемом
//                          модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	// { *Олег Каратаев
	
	Списки.Вставить(Метаданные.Задачи.ЗадачиПользователя, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗатраченноеВремяПоЗадачам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ХронометражРабочегоВремениПользователей, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗадачиПользователяПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СообщенияОбсуждений, Истина);
	Списки.Вставить(Метаданные.Справочники.СообщенияОбсужденийПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.Сертификаты, Истина);
	
	// }
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей - Массив из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа,
//                               см. УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа
//  ПараметрыОбновления - Структура:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
//  ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
//  ОписаниеПапки.Имя           = "ДополнительныеПрофили";
//  ОписаниеПапки.Идентификатор = "69a066e7-ce81-11eb-881c-b06ebfbf08c7";
//  ОписаниеПапки.Наименование  = НСтр("ru = 'Дополнительные профили'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписанияПрофилей.Добавить(ОписаниеПапки);
//
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Родитель = "ДополнительныеПрофили";
//  ОписаниеПрофиля.Идентификатор = "70179f20-2315-11e6-9bff-d850e648b60c";
//  ОписаниеПрофиля.Наименование = НСтр("ru = 'Редактирование, отправка по почте, сохранение в файл печатных форм (дополнительно)'",
//  	ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительно назначается пользователям, которым должна быть доступна возможность редактирования,
//  	|перед печатью, отправка по почте и сохранение в файл сформированных печатных форм.'");
//  ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	// Профиль "Пользователь".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "bb5ee33a-50f4-11e3-8cbe-1c6f6520bf58";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователь'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваКупорос");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Пользователи задач".  Независимый профиль групп доступа от профиля Пользователь
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "259fa477-8a21-11e1-a099-1c6f65d78fd3";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователи задач'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ' Универсальный профиль групп доступа, предназначенный для использования задач. Может функционировать без использования ""Пользователь"".
		| Ограничения по видам доступа может быть установленово: Проекты (если заполнена) И Организация (из проекта) (если заполнена) И (Инициатор ИЛИ Исполнитель ИЛИ Входит в рабочую группу)'");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваКупорос");  // базовые права Купорос
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаУчетЗадачПользователей");
		
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Контроль задач пользователей".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "f6d59ac3-50f9-11e3-8cbe-1c6f6520bf58";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Контроль задач пользователей'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ' Дополнение к профилю Пользователи задач. Возможность полных прав к задачам пользователям.
		| Ограничения по видам доступа может быть установленово по: Проекты, Организация (из проекта)'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПользователей");
	ОписаниеПрофиля.Роли.Добавить("КонтрольЗадачПользователей");            // Ответственный координатор задач
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновСообщений");  // Ответственный за список шаблонов сообщений 
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаУчетЗадачПользователей");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Планирование задач".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "c58c82f2-4940-11e9-b6ec-10e7c61f85e8";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Планирование задач'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Предназначен для планирования выполнения задач.'");
	ОписаниеПрофиля.Роли.Добавить("ПланированиеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Добавление сертификатов в ИТ-активах".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "fc9661c3-664f-11ec-863e-708bcd55c9da";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Добавление сертификатов в ИТ-активах'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаИТАктивы");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);	
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта (например, задачи ЗадачаИсполнителя),
// от "ведущего" объекта (например,  бизнес-процесса Задание), которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект".
// 1. Стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта и
//    проверяется отсутствие ограничения чтения "ведущего" объекта.
// 2. Стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта и
//    проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным -
// в пункте 2 вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений:
//   * ВедущаяТаблица     - Строка - например Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов указанных типов.
//
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений:
//   * ВладелецПрав - Строка - полное имя таблицы значения доступа.
//
//   * Имя          - Строка - идентификатор права, например ИзменениеПапок. Право с именем УправлениеПравами
//                  должно быть обязательно определено для общей формы настройки прав "Права доступа".
//                  УправлениеПравами - это право на изменение прав по владельцу прав, которое проверяется
//                  при открытии ОбщаяФорма.НастройкиПравОбъектов.
//
//   * Заголовок    - Строка - заголовок права, например в форме НастройкиПравОбъектов:
//                  "Изменение.
//                  |папок".
//
//   * Подсказка    - Строка - подсказка к заголовку права,
//                  например "Добавление, изменение и пометка удаления папок".
//
//   * НачальноеЗначение - Булево - начальное значение флажка права при добавлении новой строки
//                  в форме "Права доступа".
//
//   * ТребуемыеПрава - Массив из Строка - имена прав, требуемых для этого права -
//                  например, право "ДобавлениеФайлов" требует права "ИзменениеФайлов".
//
//   * ЧтениеВТаблицах - Массив из Строка - полные имена таблиц, для которых это право обозначает право Чтение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц",
//                  т.к. право Чтение может зависеть только от права Чтение, то имеет смысл только символ "*"
//                  (требуется для работы шаблонов ограничения доступа).
//
//   * ИзменениеВТаблицах - Массив из Строка - полные имена таблиц, для которых это право обозначает право Изменение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  (требуется для работы шаблонов ограничения доступа).
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа, заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа, могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	// { *Олег Каратаев [28.01.2019]
	
	// ЗадачиПользователя
	Описание = Описание + "
	|Задача.ЗадачиПользователя.Чтение.Организации
	|Задача.ЗадачиПользователя.Чтение.Пользователи
	|Задача.ЗадачиПользователя.Чтение.Проекты
	|Задача.ЗадачиПользователя.Изменение.Организации
	|Задача.ЗадачиПользователя.Изменение.Пользователи
	|Задача.ЗадачиПользователя.Изменение.Проекты
	|";
	
	// ЗатраченноеВремяПоЗадачам
	Описание = Описание + "
	|РегистрСведений.ЗатраченноеВремяПоЗадачам.Чтение.Объект.Задача.ЗадачиПользователя
	|РегистрСведений.ЗатраченноеВремяПоЗадачам.Чтение.Пользователи
	|РегистрСведений.ЗатраченноеВремяПоЗадачам.Изменение.Объект.Задача.ЗадачиПользователя
	|РегистрСведений.ЗатраченноеВремяПоЗадачам.Изменение.Пользователи	
	|";
	
	// ХронометражРабочегоВремениПользователей
	Описание = Описание + "
	|РегистрСведений.ХронометражРабочегоВремениПользователей.Чтение.Объект.Задача.ЗадачиПользователя
	|РегистрСведений.ХронометражРабочегоВремениПользователей.Чтение.Пользователи
	|РегистрСведений.ХронометражРабочегоВремениПользователей.Изменение.Объект.Задача.ЗадачиПользователя
	|РегистрСведений.ХронометражРабочегоВремениПользователей.Изменение.Пользователи
	|";
	
	// }	
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
// Вызывается из процедур
//  УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа,
//  УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект, для которого записываются наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка и т. п.
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
